package Fariba.Learn.datastructure;

public class DefineDatastructure {
}
// محل ذخیره اطلاعات- روشهای مختلف ذخیره داده
// انواع ساختمان داده : خطی و غیر خطی
// ساختمان داده خطی: آرایه، لیست پیوندی، ایستا یا ثابت, پشته و صف
// Array- Link list- Static- Stack- Queue
//  عناصر آن به صورت متوالی و به ترتیب قرار گرفته‌اند
// ساختمان داده غیرخطی: درخت دودویی، ساختمان داده پیشوندی، هرمی و گراف
// Binary Tree- Trie Tree- Heap- Graph
// الگوریتمها برای ویرایش و طراحی ساختمان داده‌ها مورد استفاده قرار می‌گیرند
// علت استفاده: از آن‌جایی که مقدار داده‌ها در پروژه‌ها به سرعت رو به افزایش است، برنامه‌ها روز به روز پیچیده‌تر می‌شوند و مشکلاتی برای آن‌ها پیش می‌آید
// مشکلات: سرعت پردازش- جست وجوی داده ها- چندین درخواست در یک زمان یکسان
//
